SimpleRNN (rnn_base)  参数量: 13,441
==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
SimpleRNN                                [32, 1]                   --
├─RNN: 1-1                               [32, 14, 64]              13,376
├─Linear: 1-2                            [32, 1]                   65
==========================================================================================
Total params: 13,441
Trainable params: 13,441
Non-trainable params: 0
Total mult-adds (Units.MEGABYTES): 5.99
==========================================================================================
Input size (MB): 0.02
Forward/backward pass size (MB): 0.23
Params size (MB): 0.05
Estimated Total Size (MB): 0.31
==========================================================================================

LSTM (lstm_base)  参数量: 53,569
==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
LSTM                                     [32, 1]                   --
├─LSTM: 1-1                              [32, 14, 64]              53,504
├─Linear: 1-2                            [32, 1]                   65
==========================================================================================
Total params: 53,569
Trainable params: 53,569
Non-trainable params: 0
Total mult-adds (Units.MEGABYTES): 23.97
==========================================================================================
Input size (MB): 0.02
Forward/backward pass size (MB): 0.23
Params size (MB): 0.21
Estimated Total Size (MB): 0.47
==========================================================================================

GRU (gru_base)  参数量: 40,193
==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
GRU                                      [32, 1]                   --
├─GRU: 1-1                               [32, 14, 64]              40,128
├─Linear: 1-2                            [32, 1]                   65
==========================================================================================
Total params: 40,193
Trainable params: 40,193
Non-trainable params: 0
Total mult-adds (Units.MEGABYTES): 17.98
==========================================================================================
Input size (MB): 0.02
Forward/backward pass size (MB): 0.23
Params size (MB): 0.16
Estimated Total Size (MB): 0.41
==========================================================================================

